# Pandas DataFrame exercises

In [1]:
import numpy as np

import pandas as pd

--------
## DataFrame creation

### Crie um DataFrame Vazio

In [2]:
teste = pd.DataFrame([{None:None}])

In [3]:
teste

   None
0  None

<img width=400 src="https://cdn.dribbble.com/users/4678/screenshots/1986600/avengers.png"></img>


###Crie um  `marvel_df` com os dados abaixo

In [4]:
marvel_data = [
    ['Spider-Man', 'male', 1962],
    ['Captain America', 'male', 1941],
    ['Wolverine', 'male', 1974],
    ['Iron Man', 'male', 1963],
    ['Thor', 'male', 1963],
    ['Thing', 'male', 1961],
    ['Mister Fantastic', 'male', 1961],
    ['Hulk', 'male', 1962],
    ['Beast', 'male', 1963],
    ['Invisible Woman', 'female', 1961],
    ['Storm', 'female', 1975],
    ['Namor', 'male', 1939],
    ['Hawkeye', 'male', 1964],
    ['Daredevil', 'male', 1964],
    ['Doctor Strange', 'male', 1963],
    ['Hank Pym', 'male', 1962],
    ['Scarlet Witch', 'female', 1964],
    ['Wasp', 'female', 1963],
    ['Black Widow', 'female', 1964],
    ['Vision', 'male', 1968]
]

In [5]:
x = [i[0] for i in marvel_data]
x

['Spider-Man',
 'Captain America',
 'Wolverine',
 'Iron Man',
 'Thor',
 'Thing',
 'Mister Fantastic',
 'Hulk',
 'Beast',
 'Invisible Woman',
 'Storm',
 'Namor',
 'Hawkeye',
 'Daredevil',
 'Doctor Strange',
 'Hank Pym',
 'Scarlet Witch',
 'Wasp',
 'Black Widow',
 'Vision']

In [6]:
marvel_data_df = pd.DataFrame(marvel_data)

In [7]:
marvel_data_df

                   0       1     2
0         Spider-Man    male  1962
1    Captain America    male  1941
2          Wolverine    male  1974
3           Iron Man    male  1963
4               Thor    male  1963
5              Thing    male  1961
6   Mister Fantastic    male  1961
7               Hulk    male  1962
8              Beast    male  1963
9    Invisible Woman  female  1961
10             Storm  female  1975
11             Namor    male  1939
12           Hawkeye    male  1964
13         Daredevil    male  1964
14    Doctor Strange    male  1963
15          Hank Pym    male  1962
16     Scarlet Witch  female  1964
17              Wasp  female  1963
18       Black Widow  female  1964
19            Vision    male  1968


### Adicione a coluna nomes ao DF

In [8]:
marvel_data_df.columns = ["nome", "sexo", "ano"]

In [9]:
marvel_data_df.head()

              nome  sexo   ano
0       Spider-Man  male  1962
1  Captain America  male  1941
2        Wolverine  male  1974
3         Iron Man  male  1963
4             Thor  male  1963

#
## Adicione o index `marvel_df` (use o nome dos personagens como index)

In [10]:
marvel_data_df["nome"].to_list()

['Spider-Man',
 'Captain America',
 'Wolverine',
 'Iron Man',
 'Thor',
 'Thing',
 'Mister Fantastic',
 'Hulk',
 'Beast',
 'Invisible Woman',
 'Storm',
 'Namor',
 'Hawkeye',
 'Daredevil',
 'Doctor Strange',
 'Hank Pym',
 'Scarlet Witch',
 'Wasp',
 'Black Widow',
 'Vision']

In [11]:
marvel_data_df.set_index('nome', inplace=True)

In [13]:
marvel_data_df

                    sexo   ano
nome
Spider-Man          male  1962
Captain America     male  1941
Wolverine           male  1974
Iron Man            male  1963
Thor                male  1963
Thing               male  1961
Mister Fantastic    male  1961
Hulk                male  1962
Beast               male  1963
Invisible Woman   female  1961
Storm             female  1975
Namor               male  1939
Hawkeye             male  1964
Daredevil           male  1964
Doctor Strange      male  1963
Hank Pym            male  1962
Scarlet Witch     female  1964
Wasp              female  1963
Black Widow       female  1964
Vision              male  1968

In [14]:
marvel_data_df.sort_index()

                    sexo   ano
nome
Beast               male  1963
Black Widow       female  1964
Captain America     male  1941
Daredevil           male  1964
Doctor Strange      male  1963
Hank Pym            male  1962
Hawkeye             male  1964
Hulk                male  1962
Invisible Woman   female  1961
Iron Man            male  1963
Mister Fantastic    male  1961
Namor               male  1939
Scarlet Witch     female  1964
Spider-Man          male  1962
Storm             female  1975
Thing               male  1961
Thor                male  1963
Vision              male  1968
Wasp              female  1963
Wolverine           male  1974

### Drop a coluna nome visto que agora ela é o index


### Drop Namor e Hank Pyn

In [15]:
marvel_data_df.index

Index(['Spider-Man', 'Captain America', 'Wolverine', 'Iron Man', 'Thor',
       'Thing', 'Mister Fantastic', 'Hulk', 'Beast', 'Invisible Woman',
       'Storm', 'Namor', 'Hawkeye', 'Daredevil', 'Doctor Strange', 'Hank Pym',
       'Scarlet Witch', 'Wasp', 'Black Widow', 'Vision'],
      dtype='object', name='nome')

In [16]:
marvel_data_df.drop('Hank Pym', inplace=True)
marvel_data_df.drop('Namor', inplace=True)

In [17]:
marvel_data_df

                    sexo   ano
nome
Spider-Man          male  1962
Captain America     male  1941
Wolverine           male  1974
Iron Man            male  1963
Thor                male  1963
Thing               male  1961
Mister Fantastic    male  1961
Hulk                male  1962
Beast               male  1963
Invisible Woman   female  1961
Storm             female  1975
Hawkeye             male  1964
Daredevil           male  1964
Doctor Strange      male  1963
Scarlet Witch     female  1964
Wasp              female  1963
Black Widow       female  1964
Vision              male  1968


## DataFrame selection, slicing and indexation

### Mostre os primeiros 5 elementos do dataframe

In [ ]:
marvel_data_df.head(5)

                 sexo   ano
nome
Spider-Man       male  1962
Captain America  male  1941
Wolverine        male  1974
Iron Man         male  1963
Thor             male  1963


### Mostre os 4 últimos elementos do dataframe

In [ ]:
marvel_data_df.tail()

                  sexo   ano
nome
Doctor Strange    male  1963
Scarlet Witch   female  1964
Wasp            female  1963
Black Widow     female  1964
Vision            male  1968


### Mostre somente o sexto dos 5 primeiros elementos do DF `marvel_df`

In [ ]:
marvel_data_df.iloc[6]

sexo    male
ano     1961
Name: Mister Fantastic, dtype: object


### Mostre a primeira aparição dos elementos do meio `marvel_df`

In [21]:
marvel_data_df.iloc[len(marvel_data_df)//2]

sexo    female
ano       1961
Name: Invisible Woman, dtype: object

### Mostre os primeiros e últimos elementos `marvel_df`

In [22]:
marvel_data_df.iloc[[0, 1, -2, -1]]

                   sexo   ano
nome
Spider-Man         male  1962
Captain America    male  1941
Black Widow      female  1964
Vision             male  1968

## DataFrame manipulação e operação

### Modifique a  `first_appearance` do 'Vision' para o ano 1964

In [23]:
marvel_data_df.at['Vision', 'ano'] = 1964

In [24]:
marvel_data_df.loc["Vision"]["ano"]

1964

In [64]:
marvel_data_df.shape

(18, 2)


### Adicione uma nova coluna para o dataframe  `marvel_df` chamada   'years_since' com os anos desde  `first_appearance`

In [26]:
marvel_data_df[marvel_data_df["ano"] > 1964]

             sexo   ano
nome
Wolverine    male  1974
Storm      female  1975

In [27]:
marvel_data_df["years_since"] = marvel_data_df["ano"] - 1964

In [28]:
marvel_data_df

                    sexo   ano  years_since
nome
Spider-Man          male  1962           -2
Captain America     male  1941          -23
Wolverine           male  1974           10
Iron Man            male  1963           -1
Thor                male  1963           -1
Thing               male  1961           -3
Mister Fantastic    male  1961           -3
Hulk                male  1962           -2
Beast               male  1963           -1
Invisible Woman   female  1961           -3
Storm             female  1975           11
Hawkeye             male  1964            0
Daredevil           male  1964            0
Doctor Strange      male  1963           -1
Scarlet Witch     female  1964            0
Wasp              female  1963           -1
Black Widow       female  1964            0
Vision              male  1964            0


## DataFrame boolean arrays

### Dê ao  `marvel_df` mostrando somente os personagens femininos

In [29]:
marvel_data_df[marvel_data_df["sexo"] == "female"]

                   sexo   ano  years_since
nome
Invisible Woman  female  1961           -3
Storm            female  1975           11
Scarlet Witch    female  1964            0
Wasp             female  1963           -1
Black Widow      female  1964            0


### Given the `marvel_df` pandas DataFrame, get the male characters

In [30]:
marvel_data_df[marvel_data_df["sexo"] == "male"]

                  sexo   ano  years_since
nome
Spider-Man        male  1962           -2
Captain America   male  1941          -23
Wolverine         male  1974           10
Iron Man          male  1963           -1
Thor              male  1963           -1
Thing             male  1961           -3
Mister Fantastic  male  1961           -3
Hulk              male  1962           -2
Beast             male  1963           -1
Hawkeye           male  1964            0
Daredevil         male  1964            0
Doctor Strange    male  1963           -1
Vision            male  1964            0


### Given the `marvel_df` pandas DataFrame, get the characters with `first_appearance` after 1970

In [32]:
marvel_data_df[marvel_data_df["ano"] > 1970]

             sexo   ano  years_since
nome
Wolverine    male  1974           10
Storm      female  1975           11


### Given the `marvel_df` pandas DataFrame, get the female characters with `first_appearance` after 1970

In [39]:
marvel_data_df[(marvel_data_df["ano"] > 1970) & (marvel_data_df["sexo"] == "female")]

         sexo   ano  years_since
nome
Storm  female  1975           11

## DataFrame summary statistics

In [40]:
marvel_data_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 18 entries, Spider-Man to Vision
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   sexo         18 non-null     object
 1   ano          18 non-null     int64
 2   years_since  18 non-null     int64
dtypes: int64(2), object(1)
memory usage: 1.1+ KB

In [42]:
marvel_data_df.describe().T

,count,mean,std,min,25%,50%,75%,max
ano,18.0,1962.888889,6.720372,1941.0,1962.0,1963.0,1964.0,1975.0
years_since,18.0,-1.111111,6.720372,-23.0,-2.0,-1.0,0.0,11.0